app/views/permissions/_form.html.erb

    <%= f.label :user_id %><br />
    <%= collection_select(:permission, :user_id, User.all, :id, :name) %>
---
SELECT "users".* FROM "users"

    <%= f.label :feed_id %><br />
    <%= collection_select(:permission, :feed_id, Feed.find(:all, :conditions => {:user_id => current_user, :private => true}), :id, :title) %>
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = 4 AND "feeds"."private" = 't'