app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
SELECT "permissions".* FROM "permissions" WHERE "permissions"."user_id" = 6 AND "permissions"."feed_id" = 12
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
  def index

    @feeds = Feed.all

    if signed_in?
      @permissions = Permission.find(:all, :conditions => {:user_id => current_user})
      @feeds.keep_if{ |feed|
       (feed.private == false) ||
       (feed.user_id == current_user.id) ||
       (Permission.find(:all, :conditions => {:user_id => current_user, :feed_id => feed.id}) != [])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @feed = Feed.find(params[:id])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @feed = Feed.find(params[:id])

INSERT INTO "feeds" ("body", "created_at", "private", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @feed= current_user.feeds.create(params[:feed])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "feeds" SET "body" = 'This is my test. I''m going to add some more text here. This is my test. I''m going to add some more text here. This is my test. I''m going to add some more text here. This is my test. I''m going to add some more text here.', "updated_at" = '2013-03-01 21:21:24.462999' WHERE "feeds"."id" = 1
---
  def update
    @feed = Feed.find(params[:id])

    if @feed.update_attributes(params[:feed])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 1]]
---
  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy