app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions"
---
  def index
   @permissions = Permission.all

SELECT "users".* FROM "users"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = 3 AND "feeds"."id" IS NULL LIMIT 1
---
  def new
    @user = User.all
    @feed = Feed.find(:all, :conditions => {:user_id => current_user})

INSERT INTO "permissions" ("created_at", "feed_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 07 Mar 2013 21:26:22 UTC +00:00], ["feed_id", 10], ["updated_at", Thu, 07 Mar 2013 21:26:22 UTC +00:00], ["user_id", 4]]
---
  def create
    @permission = Permission.new(params[:permission])

    if @permission.save

SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "permissions" WHERE "permissions"."id" = ?  [["id", 4]]
---
  def destroy
    @permission = Permission.find(params[:id])
    @permission.destroy