app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 20 Feb 2013 23:59:30 UTC +00:00], ["email", "test1@test1.com"], ["name", "Test1"], ["password", "test1"], ["updated_at", Wed, 20 Feb 2013 23:59:30 UTC +00:00]]

  def update
  @user = User.find(params[:id])

  if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "name" = 'Aclaire', "email" = 'aclaire@claire.com', "password_digest" = '$2a$10$S.tZKOtdad1a3Etq/edH0OuDOyl1V1N3haS4EdYXQLr5zz/TKaWae', "remember_token" = 'x25l6hoX8NUROxLtj1NdfQ', "updated_at" = '2013-03-01 00:02:46.096916' WHERE "users"."id" = 4